Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Plugin/CakeSearchInfo/Locale/rus/LC_MESSAGES/cake_search_info.po
Languages: ru

source: Invalid fields for filter of search scope.
ru: Недопустимые поля для фильтра область поиска.

source: No results for searching "%s"
ru: Нет результатов для поиска "%s"

source: Input minimum %d %s
ru: Введите не менее %d %s

source: Enter your query in the search bar
ru: Введите запрос в строку поиска

source: character
ru: символа

source: Search
ru: Поиск

source: Search information
ru: Поиск информации

source: Search settings
ru: Параметры поиска

source: In any part of the string
ru: В любой части строки

source: The scope of the search
ru: Область поиска

source: Select all
ru: Отметить всё

source: Deselect all
ru: Cнять выделение

source: Set search scope filter
ru: Установить фильтр области поиска

source: Showing results for "%s"
ru: Показаны результаты по запросу "%s"

source: Search instead "%s"
ru: Искать вместо этого "%s"

source: Results of search "%s"
ru: Результаты поиска "%s"

source: Found %s %s.
ru: Найдено %s %s.

source: &lt;None&gt;
ru: &lt;Нет&gt;

source: result
ru: результат

source: Results of search
ru: Результаты поиска

source: New search
ru: Новый поиск
