Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Plugin/CakeNotify/Locale/rus/LC_MESSAGES/cake_notify.po
Languages: ru

source: This email was sent %s automatically, please do not reply to it.
ru: Это письмо было отправлено %s автоматически, пожалуйста, не отвечайте на него.

source: Clearing expired notifications
ru: Очистка оповещений с истекшим сроком действия

source: Cron task Shell
ru: Оболочка задач Cron

source: This shell is used to execute task scheduled.
ru: Эта оболочка используется для выполнения задач по расписанию.

source: Available tasks: %s.
ru: Доступные задачи: %s.

source: and
ru: и

source: This task is used to clearing expired notifications.
ru: Эта задача используется для очистки оповещений с истекшим сроком действия.

source: Clear notifications in progress...
ru: Выполняется очистка оповещений...

source: Notifications clear successfully.
ru: Оповещения успешно удалены.

source: Notifications clear unsuccessfully.
ru: Оповещения удалены неуспешно.
