Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Locale/rus/LC_MESSAGES/app_ldap_field_tooltip.po
Languages: ru

source: Display name of employee
ru: Отображаемое имя сотрудника

source: Initials name of employee
ru: Инициалы сотрудника

source: Surname of employee
ru: Фамилия сотрудника

source: Given name of employee
ru: Имя сотрудника

source: Middle name of employee
ru: Отчество сотрудника

source: Position of employee
ru: Должность сотрудника

source: Subdivision of employee
ru: Подразделение сотрудника

source: Department of employee
ru: Отдел сотрудника

source: Interoffice telephone of employee. Format: %s, where X - number from 0 to 9
ru: Внутренний телефон сотрудника. Формат: %s, где X - число от 0 до 9

source: Local telephone of employee. Format: E.164, e.g. %s, where X - number from 0 to 9
ru: Городской телефон сотрудника. Формат: E.164, например, %s, где X - число от 0 до 9

source: Mobile telephone of employee. Format: E.164, e.g. %s, where X - number from 0 to 9
ru: Мобильный телефон сотрудника. Формат: E.164, например, %s, где X - число от 0 до 9

source: Other mobile telephone of employee. Format: E.164, e.g. %s, where X - number from 0 to 9
ru: Личный мобильный телефон сотрудника. Формат: E.164, например, %s, где X - число от 0 до 9

source: Office room of employee. Format: %s, where X - number from 0 to 9, L - letter
ru: Кабинет сотрудника. Формат: %s, где X - число от 0 до 9, L - буква

source: E-mail of employee
ru: E-mail сотрудника

source: Manager of employee
ru: Руководитель сотрудника

source: Photo of employee %dpx X %dpx in JPEG format
ru: Фото сотрудника %dpx X %dpx в формате JPEG

source: Computer of employee
ru: Компьютер сотрудника

source: Employee ID. Format: %s, where X - number from 0 to 9
ru: Табельный номер сотрудника. Формат: %s, где X - число от 0 до 9

source: Company name of employee
ru: Название организации сотрудника

source: Date of birthday. Format: %s, where YYYY - year, MM - month and DD - day
ru: Дата рождения. Формат: %s, где YYYY-год, MM-месяц и DD-день

source: SIP telephone. Format: %s, where X - number from 0 to 9
ru: SIP-телефон. Формат: %s, где X-номер от 0 до 9
