Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Locale/rus/LC_MESSAGES/app_ldap_field_name.po
Languages: ru

source: Distinguished name
ru: Отличительное имя

source: Disting. name
ru: Отлич. имя

source: Initials
ru: Инициалы

source: Init.
ru: Иниц.

source: Surname
ru: Фамилия

source: Surn.
ru: Фам.

source: Given name
ru: Имя

source: Giv. name
ru: Имя

source: Middle name
ru: Отчество

source: Mid. name
ru: Отчество

source: Position
ru: Должность

source: Pos.
ru: Долж.

source: Subdivision
ru: Подразделение

source: Subdiv.
ru: Подразд.

source: Department
ru: Отдел

source: Depart.
ru: Отдел

source: Group telephone
ru: Групповой телефон

source: Group. tel.
ru: Групп. тел.

source: Landline telephone
ru: Стационарный телефон

source: Land. tel.
ru: Стацион. тел.

source: Mobile telephone
ru: Мобильный телефон

source: Mob. tel.
ru: Моб. тел.

source: Personal mobile telephone
ru: Личный мобильный телефон

source: Person. mob. tel.
ru: Личный моб. тел.

source: Office room
ru: Комната

source: Office
ru: Комната

source: Manager
ru: Руководитель

source: Manag.
ru: Руковод.

source: Photo
ru: Фото

source: Computer
ru: Компьютер

source: Comp.
ru: Комп.

source: Employee ID
ru: Табельный номер

source: Empl. ID
ru: Таб. ном.

source: Company name
ru: Название организации

source: Comp. name
ru: Назв. организ.

source: Birthday
ru: День рождения

source: Birthd.
ru: День рожд.

source: SIP telephone
ru: SIP телефон

source: SIP tel.
ru: SIP тел.

# employee
source: Name
ru: ФИО

source: Internal telephone
ru: Внутренний телефон

source: Int. tel.
ru: Вн. тел.
