Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Locale/rus/LC_MESSAGES/default.po
Languages: ru

source: secretary
ru: секретарь

source: human resources
ru: отдел кадров

source: administrator
ru: администратор

source: Generate PDF or Excel files
ru: Создание файлов PDF или Excel

source: Cron task of the shell
ru: Задача Cron оболочки

source: This shell is used to execute task scheduled.
ru: Эта оболочка используется для выполнения задач по расписанию.

source: Available tasks: %s.
ru: Доступные задачи: %s.

source: and
ru: и

source: This task is used to checking new deferred saves scheduled.
ru: Эта задача используется для проверки новых отложенных сохранений по расписанию.

source: Checking new deferred saves in progress...
ru: Выполняется проверка новых отложенных сохранений...

source: Checking new deferred saves complete successfully.
ru: Проверка новых отложенных сохранений успешно завершена.

source: Checking new deferred saves complete unsuccessfully.
ru: Проверка новых отложенных сохранений завершена неудачно.

source: The view of generated files.
ru: Вид создаваемых файлов.

source: The type of generated files.
ru: Тип создаваемых файлов.

source: This task is used to generate PDF or Excel files scheduled.
ru: Эта задача используется для создания файлов PDF или Excel по расписанию.

source: Empty parameters. Run this task with parameter '-h' or '--help'
ru: Пустые параметры. Запустите эту задачу с параметром '-h' или '--help'

source: Invalid parameters. Run this task with parameter '-h' or '--help'
ru: Недопустимые параметры. Запустите эту задачу с параметром '-h' или '--help'

source: Generate %s files (%s) in progress...
ru: Выполняется создание %s файлов (%s)...

source: Generate %s files set in queue successfully.
ru: Создание %s файлов успешно поставлено в очередь.

source: Generate %s set in queue unsuccessfully.
ru: Создание %s файлов поставлено в очередь неудачно.

source: CakePHP Queue task for processing deferred saves.
ru: Задача очереди CakePHP для обработки отложенных сохранений.

source: Found processing internal deferred saves task in queue: %d. Skipped.
ru: Найдено задач обработки внутренних отложенных сохранений в очереди: %d. Пропущено.

source: CakePHP Queue task for generating files.
ru: Задача очереди CakePHP для создания файлов.

source: Found generating task in queue: %d. Skipped.
ru: Найдено задач создания в очереди: %d. Пропущено.

source: CakePHP Queue task for ordering tree.
ru: Задача очереди CakePHP для упорядочения дерева.

source: Found order task in queue: %d. Skipped.
ru: Найдено задач в очереди: %d. Пропущено.

source: Tree of departments is broken. Perform a restore.
ru: Дерево из отделов разрушено. Выполните восстановление.

source: Error on reorder tree of departments.
ru: Ошибка при пересортировке дерева отделов.

source: CakePHP Queue task for recovering tree.
ru: Задача очереди CakePHP для восстановления дерева.

source: The recovery tree of departments is not required
ru: Не требуется восстановление дерева отделов

source: Error on recovery tree of departments.
ru: Ошибка при восстановлении дерева отделов.

source: CakePHP Queue task for renaming department.
ru: Задача очереди CakePHP для переименования отдела.

source: Error on renaming department from "%s" to "%s"
ru: Ошибка при переименовании отдела из "%s" в "%s"

source: Delete data group
ru: Удаление группы данных

source: Approve data group
ru: Утверждение группы данных

source: Reject data group
ru: Отклонение группы данных

source: Processing of selected tasks put in queue...
ru: Обработка выбранных задач помещена в очередь...

source: Selected tasks has been processed.
ru: Выбранные задачи были обработаны.

source: Selected tasks could not be processed. Please, try again.
ru: Не удалось обработать выбранные задачи. Пожалуйста, попробуйте еще раз.

source: Deferred saves not found
ru: Отложенные сохранения не найдены

source: Index of deferred saves
ru: Указатель отложенных сохранений

source: Index
ru: Указатель

source: Invalid ID for deferred save
ru: Неверный идентификатор для отложенного сохранения

source: Information of deferred save
ru: Информация об отложенном сохранении

source: Edit deferred save
ru: Редактировать отложенное сохранение

source: Editing information of this deferred save
ru: Редактирование информации отложенного сохранения

source: Delete deferred save
ru: Удалить отложенное сохранение

source: Are you sure you wish to delete this deferred save?
ru: Вы уверены, что хотите удалить это отложенное сохранение?

source: Approve deferred save data
ru: Утвердить данные отложенного сохранения

source: Are you sure you wish to approve this deferred save?
ru: Вы уверены, что хотите утвердить это отложенное сохранение?

source: Reject deferred save data
ru: Отклонить данные отложенного сохранения

source: Are you sure you wish to reject this deferred save?
ru: Вы уверены, что хотите отклонить это отложенное сохранение?

source: Viewing
ru: Просмотр

source: Data of deferred save is broken
ru: Данные отложенного сохранения нарушены

source: The deferred save has been saved.
ru: Отложенное сохранение было сохранено.

source: The deferred save not be saved. Please, try again.
ru: Отложенное сохранение не сохранено. Пожалуйста, попробуйте еще раз.

source: Editing deferred save
ru: Редактирование отложенного сохранения

source: Editing
ru: Редактирование

source: The deferred save has been deleted.
ru: Отложенное сохранение было удалено.

source: The deferred save could not be deleted. Please, try again.
ru: Не удалось удалить отложенное сохранение. Пожалуйста, попробуйте еще раз.

source: rejected
ru: отклонено

source: approved
ru: утверждено

source: The deferred save has been %s.
ru: Отложенное сохранение было %s.

source: The deferred save could not be %s. Please, try again.
ru: Отложенное сохранение не может быть %s. Пожалуйста, попробуйте ещё раз.

source: Departments not found
ru: Отделы не найдены

source: Index of departments
ru: Указатель отделов

source: Add department
ru: Добавить отдел

source: Order list of departments
ru: Упорядочение списка отделов

source: Order list of departments by alphabet
ru: Упорядочение списка отделов по алфавиту

source: Are you sure you wish to re-order list of departments?
ru: Вы уверены, что хотите пересортировать список отделов?

source: Check state list
ru: Проверка состояния списка

source: Check state list of departments
ru: Проверка состояния списка отделов

source: Invalid ID for department
ru: Неверный идентификатор отдела

source: Information of department
ru: Информация отдела

source: Editing department
ru: Редактирование отдела

source: Editing information of this department
ru: Редактирование информации этого отдела

source: Delete department
ru: Удалить отдел

source: Are you sure you wish to delete this department?
ru: Вы уверены, что хотите удалить этот отдел?

source: Department has been saved.
ru: Отдел был сохранён.

source: Department could not be saved. Please, try again.
ru: Отдел не может быть сохранён. Пожалуйста, попробуйте еще раз.

source: Adding department
ru: Добавление отдела

source: Adding
ru: Добавление

source: Renaming department from "%s" to "%s" put in queue...
ru: Переименование отдела из "%s" в "%s" помещено в очередь...

source: The department has been deleted.
ru: Отдел был удалён.

source: The department could not be deleted. Please, try again.
ru: Отдел не может быть удалён. Пожалуйста, попробуйте ещё раз.

source: Checking state list of departments
ru: Проверка состояния списка отделов

source: Recovery state of list
ru: Восстановление состояния списка

source: Checking the list
ru: Проверка списка

source: Recovering list of departments put in queue...
ru: Восстановление списка отделов помещено в очередь...

source: Recovering list of departments put in queue unsuccessfully
ru: Восстановление списка отделов поставлено в очередь неудачно

source: Ordering list of departments put in queue...
ru: Упорядочение списка отделов помещено в очередь...

source: Ordering list of departments put in queue unsuccessfully
ru: Упорядочение списка отделов помещено в очередь неудачно

source: Information retrieval
ru: Поиск информации

source: Search information
ru: Поиск информации

source: Information of employees
ru: Информация о сотрудниках

source: Edit information
ru: Редактировать информацию

source: Edit information of this employee
ru: Редактировать информацию этого сотрудника

source: Synchronize information
ru: Синхронизация информации

source: Synchronize information of this employee with LDAP server
ru: Синхронизация информации этого сотрудника с сервером LDAP

source: Tree of subordinate
ru: Дерево подчинённых

source: Edit tree of subordinate employee
ru: Редактировать дерево подчинённых сотрудника

source: Invalid GUID for employee
ru: Неверный GUID для сотрудника

source: GUID of user is not equal GUID of employee
ru: GUID пользователя не равен GUID сотрудника

source: Deferred saving with an updated employee information was created.<br />Information on LDAP server will be updated by queue.<br />Information in phonebook will be updated %s after processing.
ru: Было создано отложенное сохранение с обновленной информацией о сотруднике.<br />Информация на сервере LDAP будет обновлена по очереди.<br />Информация в телефонной книге будет обновлена %s после обработки.

source: Deferred saving with an updated employee information was created.<br />Information will be updated after approval by the administrator.
ru: Создано отложенное сохранение с обновленной информацией о сотруднике.<br />Информация будет обновлена после утверждения администратором.

source: Information about the employee could not be been saved. Please, try again.
ru: Информация о сотруднике не может быть сохранена. Пожалуйста, попробуйте еще раз.

source: Editing employee
ru: Редактирование сотрудника

source: Display photo of employee not allowed
ru: Отображение фотографии сотрудника не допускается

source: Employees not found
ru: Сотрудники не найдены

source: Gallery of employees
ru: Галерея сотрудников

source: Gallery
ru: Галерея

source: Tree view information of employees
ru: Древовидное представление информации о сотрудниках

source: Synchronizing information with LDAP server
ru: Синхронизация информации с сервером LDAP

source: Synchronize information of employees with LDAP server
ru: Синхронизировать информацию сотрудников с сервером LDAP

source: Check state tree of employees
ru: Проверка состояния дерева сотрудников

source: Editing tree of employees
ru: Редактирование дерева сотрудников

source: Order tree of employees
ru: Упорядочивание дерева сотрудников

source: Order tree of employees by alphabet
ru: Упорядочивание дерева сотрудников по алфавиту

source: Are you sure you wish to re-order tree of employees?
ru: Вы уверены, что хотите пересортировать дерево сотрудников?

source: Tree viewing
ru: Просмотр дерева

source: Checking state tree of employees
ru: Проверка состояния дерева сотрудников

source: Recovery state of tree
ru: Восстановление состояния дерева

source: Checking tree
ru: Проверка дерева

source: Deferred saving with an deleted employee photo was created.<br />Information on LDAP server will be updated by queue.<br />Information in phonebook will be updated %s after processing.
ru: Было создано отложенное сохранение с удаленной фотографией сотрудника.<br />Информация на сервере LDAP будет обновлена по очереди.<br />Информация в телефонной книге будет обновлена %s после обработки.

source: Deferred saving with an deleted employee photo was created.<br />Information will be updated after approval by the administrator.
ru: Создано отложенное сохранение с удаленной фотографией сотрудника.<br />Информация будет обновлена после утверждения администратором.

source: The photo of employee could not be deleted. Please, try again.
ru: Фотография сотрудника не может быть удалена. Пожалуйста, попробуйте еще раз.

source: Invalid request
ru: Неверный запрос

source: Deferred saving with an updated employee photo was created.<br />Information on LDAP server will be updated by queue.<br />Information in phonebook will be updated %s after processing.
ru: Было создано отложенное сохранение с обновленной фотографией сотрудника.<br />Информация на сервере LDAP будет обновлена по очереди.<br />Информация в телефонной книге будет обновлена %s после обработки.

source: Deferred saving with an updated employee photo was created.<br />Information will be updated after approval by the administrator.
ru: Создано отложенное сохранение с обновленной фотографией сотрудника.<br />Информация будет обновлена после утверждения администратором.

source: Unable to update photo of employee.
ru: Не удалось обновить фотографию сотрудника.

source: Index of phone book files
ru: Указатель файлов телефонного справочника

source: Refresh all files
ru: Обновить все файлы

source: Refresh all exported files
ru: Обновить все экспортируемые файлы

source: Export phone book
ru: Экспорт телефонного справочника

source: Unknown type for generation %s.
ru: Неизвестный тип для создания %s.

source: Invalid export type
ru: Неверный тип экспорта

source: Generation file "%s" put in queue...
ru: Создание файла "%s" помещено в очередь...

source: Generation file "%s" put in queue unsucsessfully...
ru: Создание файла "%s" помещено в очередь неудачно...

source: Generation of exported files put in queue...
ru: Создание экспортируемых файлов помещено в очередь...

source: Generation export files put in queue unsucsessfully...
ru: Создание экспортируемых файлов помещено в очередь неудачно...

source: Logs not found
ru: Журналы не найдены

source: Index of logs
ru: Указатель журналов

source: Clear logs
ru: Очистить журналы

source: Are you sure you wish to clear logs?
ru: Вы уверены, что хотите очистить журналы?

source: Invalid ID for record of log
ru: Неверный идентификатор для записи журнала

source: Information of log record
ru: Информация о записи журнала

source: Restore data from log
ru: Восстановить данные из журнала

source: Are you sure you wish to restore this data from log?
ru: Вы уверены, что хотите восстановить эти данные из журнала?

source: Delete record of log
ru: Удалить запись журнала

source: Are you sure you wish to delete this record of log?
ru: Вы уверены, что хотите удалить эту запись из журнала?

source: The log record has been deleted.
ru: Запись журнала была удалена.

source: The log record could not be deleted. Please, try again.
ru: Запись журнала не может быть удалена. Пожалуйста, попробуйте еще раз.

source: Deferred saving with an restored employee information was created.<br />Information on LDAP server will be updated by queue.<br />Information in phonebook will be updated %s after processing.
ru: Было создано отложенное сохранение с восстановленной информацией о сотруднике.<br />Информация на сервере LDAP будет обновлена по очереди.<br />Информация в телефонной книге будет обновлена %s после обработки.

source: The data could not be restored from log record. Please, try again.
ru: Данные не могут быть восстановлены из записи журнала. Пожалуйста, попробуйте еще раз.

source: The logs has been cleared.
ru: Журналы были очищены.

source: The logs could not be cleared. Please, try again.
ru: Журналы не могут быть очищены. Пожалуйста, попробуйте еще раз.

source: Invalid data of deferred save for employee: "%s".
ru: Недопустимые данные отложенного сохранения для сотрудника: "%s".

source: Error on approving deferred save with employee DN: "%s".
ru: Ошибка при утверждении отложенного сохранения с DN сотрудника: "%s".

source: Error on deleting deferred saves after approving
ru: Ошибка при удалении отложенных сохранений после утверждения

source: Error on rejecting deferred saves
ru: Ошибка при отклонении отложенных сохранений

source: Changing information of phone book
ru: Изменение информации телефонного справочника

source: Error on putting sending e-mail for "%s" in queue...
ru: Ошибка при помещении отправки электронной почты для "%s" в очередь...

source: Found new deferred saves
ru: Найдены новые отложенные сохранения

source: Deferred saves
ru: Отложенные сохранения

source: Departments
ru: Отделы

source: Employees
ru: Сотрудники

source: by alphabet
ru: по алфавиту

source: by department
ru: по отделам

source: Directory
ru: Справочник

source: full
ru: полный

source: Non-staff personnel
ru: Внештатные сотрудники

source: Created %s
ru: Создан %s

source: Directory of staff by alphabet
ru: Справочник сотрудников по алфавиту

source: Directory of staff by department
ru: Справочник сотрудников по отделам

source: Update file "%s" is not required
ru: Обновление файла "%s" не требуется

source: Error on generating file "%s"
ru: Ошибка при создании файла "%s"

source: Result of creating files
ru: Результат создания файлов

source: Invalid the GUID or Distinguished name of an LDAP entity
ru: Недопустимый идентификатор GUID или Отличительное имя объекта LDAP

source: Invalid file for update.
ru: Неверный файл для обновления.

source: File size is %s. Limit - %s.
ru: Размер файла %s. Ограничение - %s.

source: The uploaded photo is not a jpeg
ru: Загруженное фото не в формате JPEG

source: Error resizing file photo.
ru: Ошибка при изменении размера файла фотографии.

source: Error reading file photo.
ru: Ошибка при чтении файла фотографии.

source: Logs
ru: Журналы

source: Manage information about employees
ru: Управление информацией о сотрудниках

source: Tree of employees
ru: Дерево сотрудников

source: Tree view of employess
ru: Древовидное представление сотрудников

source: Saving a local copy of the phone book
ru: Сохранение локальной копии телефонного справочника

source: View logs of changing information
ru: Просмотр журналов изменения информации

source: Check state tree
ru: Проверка состояния дерева

source: Informations of employees
ru: Информация о сотрудниках

source: Manage information about departments
ru: Управление информацией об отделах

source: Informations of departments
ru: Информация об отделах

source: Manage deferred saves
ru: Управление отложенными сохранениями

source: Application settings
ru: Настройки приложения

source: Queue of tasks
ru: Очередь задч

source: Task queue list
ru: Список задач

source: Logout
ru: Выйти

source: Login
ru: Войти

source: Contact administrator
ru: Связаться с администратором

source: Name of department
ru: Наименование отдела

source: Short name of department
ru: Краткое наименование отдела

source: Extended name of department
ru: Расширенное название отдела

source: Extended name of department (full)
ru: Расширенное название отдела (полное)

source: Save
ru: Сохранить

source: Department of employee
ru: Отдел сотрудника

source: Select department
ru: Выберите отдел

source: Manager of employee
ru: Руководитель сотрудника

source: Select manager
ru: Выберите руководителя

source: Employee information
ru: Информация о сотруднике

source: Employee photo
ru: Фото сотрудника

source: Current photo of employee on LDAP server
ru: Текущая фотография сотрудника на сервере LDAP

source: Current photo
ru: Текущая фотография

source: Delete photo
ru: Удалить фото

source: Delete current photo
ru: Удалить текущую фотографию

source: Are you sure you wish to delete current photo?
ru: Вы уверены, что хотите удалить текущую фотографию?

source: Update photo
ru: Обновить фото

source: Authentication
ru: Аутентификация

source: Allow anonymous access
ru: Разрешить анонимный доступ

source: Allow anonymous access to the phone book
ru: Разрешить анонимный доступ к телефонному справочнику

source: Photo
ru: Фото

source: Show default photo
ru: Отображать фото по умолчанию

source: Show default photo, if the photo is not specified
ru: Отображать фото по умолчанию, если фото не указано

source: Phone library
ru: Библиотека телефонов

source: Country
ru: Страна

source: Country code for parse telephone number
ru: Код страны для разбора номера телефона

source: Format of telephone number
ru: Формат номера телефона

source: Display format for telephone or mobile phone number
ru: Формат отображения номера телефона или мобильного телефона

source: Group of users for management deferred saves
ru: Группа пользователей для управления отложенными сохранениями

source: A group of users serving deferred saves: approving, rejecting, editing and deleting.
ru: Группа пользователей, обслуживающих отложенные сохранения: утверждает, отклоняет, редактирует и удаляет.

source: Search in any part string
ru: Поиск в любой части строки

source: Default value for flag of search in any part string
ru: Значение по умолчанию для флага поиска в любой части строки

source: Editing information
ru: Редактирование информации

source: Use information from LDAP
ru: Использовать информацию из LDAP

source: Use information from LDAP server instead database on editing
ru: Использовать информацию из сервера LDAP вместо базы данных при редактировании

source: Limit number of rows for multiple value
ru: Ограничение количества строк для множественных значений

source: Limit number of rows for fields with multiple value
ru: Ограничение количества строк для полей с множественными значениями

source: Fields
ru: Поля

source: Extended fields
ru: Расширенные поля

source: Fields available for user with role: secretary, human resources or administrator
ru: Поля, доступные для пользователя с ролью: секретарь, отдел кадров или администратор

source: Read only fields
ru: Поля только для чтения

source: Fields available only for read
ru: Поля доступные только для чтения

source: Today is the birthday of:
ru: Сегодня День рождения:

source: Name of employee
ru: Имя сотрудника

source: Created
ru: Создан

source: Modified
ru: Изменён

source: Extension name of department
ru: Расширения названия для отдела

source: Used
ru: Используется

source: Name of administrator
ru: Имя администратора

source: Data of log record is broken
ru: Данные записи журнала нарушены

source: The number of employees
ru: Количество сотрудников

source: Last update
ru: Последнее обновление

source: Data of deferred save
ru: Данные отложенного сохранения

source: Edit information of this deferred save
ru: Редактировать информацию этого отложенного сохранения

source: Position of department
ru: Позиция отдела

source: Edit department
ru: Редактировать отдел

source: Are you sure you wish to delete department '%s'?
ru: Вы уверены, что хотите удалить отдел '%s'?

source: File
ru: Файл

source: Actions
ru: Действия

source: Put the generation of the file in the queue
ru: Поместить создание файла в очередь

source: Download file
ru: Скачать файл

source: Data of log
ru: Данные журнала

source: Tree of subordinate employees
ru: Дерево подчинённых сотрудников

source: Changing information
ru: Изменение информации

source: Changing your information is approved
ru: Изменение вашей информации утверждено

source: one
ru: один

# deferred_save
source: one
ru: одно

source: Found %s %s
ru: Найдено %s %s

source: ...And %s more %s
ru: ...И еще %s %s

source: For management list of deferred saves, click '%s'
ru: Для управления отложенными сохранениями, нажмите "%s"

source: here
ru: здесь

source: new deferred save
ru: новое отложенное сохранение

source: record
ru: запись

source: Changing your information is rejected
ru: Изменение вашей информации отклонено

source: Results of search
ru: Результаты поиска

source: New search
ru: Новый поиск

source: Phonebook
ru: Телефонный справочник

source: Error %s: Page not found
ru: Ошибка %s: Страница не найдена

source: Error %s: Internal Server Error
ru: Ошибка %s: Внутренняя ошибка сервера
