Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Locale/rus/LC_MESSAGES/tour.po
Languages: ru

source: Start using
ru: Начало использования

source: To start using the directory, synchronize the information with LDAP server.
ru: Для начала использования справочника выполните синхронизацию информации с сервером LDAP.

source: To search for information, enter your request in this field and click the button "%s".
ru: Для поиска информации введите свой запрос в данное поле и нажмите кнопку "%s".

source: Refinement of the search result
ru: Уточнение результата поиска

source: To refine the search result, use the "%s" button.
ru: Для уточнения результата поиска используйте кнопку "%s".

source: Changes to the sorting order of table data
ru: Изменения порядка сортировки табличных данных

source: To change the sort order of tabular data, click the corresponding column heading in the table. Clicking again will change the sort direction on the opposite.<br />To display the current sort directions use symbols "%s" and "%s" next to the name of the corresponding column.
ru: Для изменения порядка сортировки табличных данных щёлкните по заголовку соответствующего столбца таблицы. Повторный щелчок приведёт к изменению направления сортировки на противоположное.<br />Для отображения текущего направления сортировки используются симолы "%s" и "%s" рядом с наименованием соответстующего столбца.

source: View information about the employee
ru: Просмотр информации о сотруднике

source: To view brief information about an employee, hover this link. Clicking will open the details window for the employee.
ru: Для просмотра краткой информации о сотруднике, наведите указатель данную ссылку. По щелчку откроется окно подробной информации о сотруднике.

source: Subordinate tree
ru: Дерево подчинённых

source: Use this button to view the subordinate employee tree.
ru: Используйте данную кнопку для просмотра дерева подчинённых сотрудника.

source: Editing of information
ru: Редактирование информации

source: To change information about the employee use this button.
ru: Для изменения информации о сотруднике воспользуйтесь данной кнопкой.

source: Synchronizing information
ru: Синхронизация информации

source: Use this button to synchronize the information of this employee with LDAP server.
ru: Используйте данную кнопку для синхронизации информации данного сотрудника с сервером LDAP.

source: Operation menu
ru: Меню операций

source: Use the operations menu for the following actions:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span>Editing information;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Synchronize information;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Viewing the subordinate employee tree.</li></ul>
ru: Используйте меню операций для следующих действий:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span>Редактирование информации;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Синхронизация информации;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Просмотр дерева подчинённых сотрудников.</li></ul>

source: Tabs for information input forms
ru: Вкладки форм ввода информации

source: This tab contains employee information fields.
ru: Данная вкладка содержит поля информации о сотруднике.

source: This tab contains information about the employee's photo.
ru: Данная вкладка содержит информацию о фотографии сотрудника.

source: Elements of the information input form
ru: Элементы формы ввода информации

source: This progress bar shows the degree of filling of the data. Can accept from several colors: <ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span><span class="bg-danger"><strong>Red</strong></span> - means that are not filled all required fields.</li><li><span class="fa-li"><i class="fas fa-check"></i></span><span class="bg-warning"><strong>Orange</strong></span> - is not filled in the required fields (allowed retention of information);</li><li><span class="fa-li"><i class="fas fa-check"></i></span><span class="bg-success"><strong>Green</strong></span> - filled in all the fields.</li></ul>
ru: Данная полоса прогресса показывает степень заполнения данных. Может принимать один из нескольких цветов: <ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span><span class="bg-danger"><strong>Красный цвет</strong></span> - означает, что заполнены не все обязательные поля;</li><li><span class="fa-li"><i class="fas fa-check"></i></span><span class="bg-warning"><strong>Оранжевый цвет</strong></span> - не заполнены не обязательные поля (допускается сохранение информации);</li><li><span class="fa-li"><i class="fas fa-check"></i></span><span class="bg-success"><strong>Зелёный цвет</strong></span> - заполнены все поля.</li></ul>

source: To select a group of fields for entering employee information, use the appropriate tab.
ru: Для выбора группы полей ввода информации о сотруднике используйте соответствующую вкладку.

source: To save the information entered in the form fields, use this button.
ru: Для сохранения внесённой в поля формы информации воспользуйтесь данной кнопкой.

source: Elements of the main menu
ru: Элементы главного меню

source: Use this menu item for the following:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span>Search for employee information</li><li><span class="fa-li"><i class="fas fa-check"></i></span>View employee submission tree</li><li><span class="fa-li"><i class="fas fa-check"></i></span>View employee gallery</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Save a local copy of the directory.</li></ul>
ru: Используйте данный элемент меню для следующих действий:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span>Поиска информации о сотрудниках;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Просмотра дерева подчинения сотрудников;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Просмотра галереи сотрудников;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Сохранения локальной копии справочника.</li></ul>

source: Use this menu item to service a list of the full department names.
ru: Используйте данный элемент меню для обслуживания списка полных наименований отделов.

source: Use this menu item to service the deferred saves of employee information.
ru: Используйте данный элемент меню для обслуживания отложенных сохранений информации о сотрудниках.

source: Use this menu item to change application settings.
ru: Используйте данный элемент меню для изменения настроек приложения.

source: Use the operations menu for the following actions:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span>Editing information;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Synchronize information;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Checking the status of the subordinate employee tree.</li></ul>
ru: Используйте меню операций для следующих действий:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span>Редактирование информации;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Синхронизация информации;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Проверка состояния дерева подчинённых сотрудников.</li></ul>

source: Use the operation menu for the following actions:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span>Synchronizing information;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Checks the status of the subordinate employee tree.</li></ul>
ru: Используйте меню операций для следующих действий:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span>Синхронизации информации;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Проверки состояния дерева подчинённых сотрудников.</li></ul>

source: Controls of moving employee
ru: Управление перемещением сотрудника

source: Use this button to display or hide the controls of moving employee.
ru: Воспользуйтесь данной кнопкой для отображения или скрытия элементов управления перемещением сотрудника.

source: Change employee position
ru: Изменение позиции сотрудника

source: To change the position of an employee by dragging, use this button. The employee's position is used to determine the order of employees in the exported files of the directory.
ru: Для изменения позиции сотрудника путём перетаскивания воспользуйтесь данной кнопкой. Позиция сотрудника используется для определения порядка сотрудников в экспортируемых файлах справочника.

source: Use the buttons "%s", "%s", "%s" and "%s" for an exact change position of the employee.
ru: Используйте кнопки "%s", "%s", "%s" и "%s" для точного изменения позиции сотрудника.

source: Table data filter
ru: Фильтр табличных данных

source: To select tabular data, use the filter.
ru: Для выборки табличных данных воспользуйтесь фильтром.

source: Current filter condition.
ru: Текущее условие фильтра.

source: Table data filter controls
ru: Элементы управления фильтром табличных данных

source: Use this button to display or hide the filter controls.
ru: Воспользуйтесь данной кнопкой для отображения или скрытия элементов управления фильтром.

source: Elements of formation of filter conditions
ru: Элементы формирования условий фильтра

source: To create a filter condition, enter the required data in the input field of the corresponding column in the table.
ru: Для создания условия фильтра внесите требуемые данные в поле ввода соответствующего столбца таблицы.

source: Use this button to select one of the following logical conditions:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span><i>=</i> - is equal to;</li><li><span class="fa-li"><i class="fas fa-check"></i></span><i>&gt;</i> - more;</li><li><span class="fa-li"><i class="fas fa-check"></i></span><i>&ge;</i> - is greater than or equal to;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>&lt;<i></i> - less;</li><li><span class="fa-li"><i class="fas fa-check"></i></span><i>&le;</i> - is less than or equal;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>&ne;<i></i> - is not equal.</li></ul>
ru: Используйте данную кнопку для выбора одного из следующих логических условий:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span><i>=</i> - равно;</li><li><span class="fa-li"><i class="fas fa-check"></i></span><i>&gt;</i> - больше;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>&ge;<i></i> - больше или равно;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>&lt<i></i> - меньше;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>&le;<i></i> - меньше или равно;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>&ne;<i></i> - не равно.</li></ul>

source: If you want to add or delete filter lines, use these buttons.
ru: При необходимости добавления или удаления строк фильтра используйте данные кнопки.

source: Using this button, you can combine several filter lines with one of the following logical conditions:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span><i>&amp;&amp;</i> - AND;</li><li><span class="fa-li"><i class="fas fa-check"></i></span><i>&nbsp;||&nbsp;</i> - OR;</li><li><span class="fa-li"><i class="fas fa-check"></i></span><i>&nbsp;!&nbsp;</i> - NOT.</li></ul>
ru: Используя данную кнопку можно объединить несколько строк фильтра одним из следующих логических условий:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span><i>&amp;&amp;</i> - И;</li><li><span class="fa-li"><i class="fas fa-check"></i></span><i>&nbsp;||&nbsp;</i> - ИЛИ;</li><li><span class="fa-li"><i class="fas fa-check"></i></span><i>&nbsp;!&nbsp;</i> - НЕ.</li></ul>

source: To apply the current filter, use this button.
ru: Для применения текущего фильтра используйте данную кнопку.

source: To clean the filter, use this button.
ru: Для очистки фильтра воспользуйтесь данной кнопкой.

source: Use this button to print current tabular data.
ru: Используйте данную кнопку для вывода на печать текущих табличных данных.

source: Use the operations menu to update all the files in the directory.
ru: Используйте меню операций для обновления всех файлов справочника.

source: Updating the directory file
ru: Обновление файла справочника

source: Use this button to update the directory file.
ru: Используйте данную кнопку для обновления файла справочника.

source: Saving a directory file
ru: Сохранение файла справочника

source: To save a local copy of the directory, use this button.
ru: Для сохранения локальной копии справочника воспользуйтесь данной кнопкой.

source: Use the operations menu for the following actions:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span>Adding new department;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Arranging the list of departments alphabetically.</li></ul>
ru: Используйте меню операций для следующих действий:<ul class="fa-ul"><li><span class="fa-li"><i class="fas fa-check"></i></span>Добавление нового отдела;</li><li><span class="fa-li"><i class="fas fa-check"></i></span>Упорядочивание списка отделов в алфавитном порядке.</li></ul>

source: Change the position of the department
ru: Изменение позиции отдела

source: To change the position of the department by dragging, use this button. The position of the department is used to determine the order of departments in the exported directory files alphabetically.
ru: Для изменения позиции отдела путём перетаскивания воспользуйтесь данной кнопкой. Позиция отдела используется для определения порядка отделов в экспортируемых файлах справочника по алфавиту.

source: Use the buttons "%s", "%s", "%s" and "%s" for an exact change positions of the department.
ru: Используйте кнопки "%s", "%s", "%s" и "%s" для точного изменения позиции отдела.

source: To change the full name of the department or rename department, use this button.
ru: Чтобы изменить полное название отдела или переименовать отдел, используйте эту кнопку.

source: Deleting information
ru: Удаление информации

source: Use this button to delete department.
ru: Используйте эту кнопку для удаления отдела.

source: To change the deferred save information, use this button.
ru: Для изменения информации отложенного сохранения воспользуйтесь данной кнопкой.

source: Use this button to delete information about deferred save.
ru: Используйте данную кнопку для удаления информации об отложенном сохранении.

source: Approval of change of information
ru: Утверждение изменения информации

source: To approve the change of information, use this button. The creator of this deferred save will receive a notification about the approval of the information being changed.
ru: Для утверждения изменения информации воспользуйтесь данной кнопкой. Создатель данного отложенного сохранения получит уведомление об утверждении изменяемой информации.

source: Rejection of change of information
ru: Отклонение изменения информации

source: To reject the change of information, use this button. The creator of this deferred save will receive a notification of rejection of the changed information.
ru: Для отклонения изменения информации воспользуйтесь данной кнопкой. Создатель данного отложенного сохранения получит уведомление об отклонении изменяемой информации.

source: Select / deselect all records
ru: Выбор / снятие выделения со всех записей

source: To select or deselect all records, use this button.
ru: Для выбора или снятия выделения со всех записей используйте данную кнопку.

source: Performing an action for a record group
ru: Выполнение действия для группы записей

source: To perform an action on the group of records selected in the filter, use this button.
ru: Для выполнения действия над выбранной в фильтре группы записей воспользуйтесь данной кнопкой.
