Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Plugin/CakeSettingsApp/Locale/rus/LC_MESSAGES/cake_settings_app.po
Languages: ru

source: CakePHP Queue clearing cache task.
ru: Очередь CakePHP задача очистки кэша.

source: Found clearing cache task in queue: %d. Skipped.
ru: Найдено задач очистки кэша в очереди: %d. Пропущено.

source: Delete selected tasks
ru: Удаление выбранных задач

source: Selected tasks has been deleted.
ru: Выбранные задачи удалены.

source: Selected tasks could not be deleted. Please, try again.
ru: Выбранные задачи не могут быть удалены. Пожалуйста, попробуйте еще раз.

source: Queue of tasks
ru: Очередь заданий

source: Clear queue of tasks
ru: Очистить очередь задач

source: Are you sure you wish to clear queue of tasks?
ru: Вы уверены, что хотите очистить очередь задач?

source: Invalid task
ru: Неверное задание

source: The task has been deleted.
ru: Задание удалено.

source: The task could not be deleted. Please, try again.
ru: Задание не может быть удалено. Пожалуйста, попробуйте снова.

source: The task queue has been cleared.
ru: Очередь задач очищена.

source: The task queue could not be cleared. Please, try again.
ru: Очередь задач не может быть очищена. Пожалуйста, попробуйте снова.

source: Application settings has been saved.
ru: Настройки приложения сохранены.

source: Reload the page to apply the settings.
ru: Перезагрузите страницу, чтобы применить настройки.

source: Unable to save application settings.
ru: Не удается сохранить настройки приложения.

source: Application settings
ru: Настройки приложения

source: Settings
ru: Настройки

source: Not ready
ru: Не готов

source: Not started
ru: Не начался

source: In progress
ru: В процессе выполнения

source: Completed
ru: Завершён

source: Failed
ru: Неудавшийся

source: Unknown
ru: Неизвестный

source: Main settings
ru: Основные настройки

source: Extended settings
ru: Расширенные настройки

source: Interface
ru: Интерфейс

source: Language
ru: Язык

source: Language of user interface
ru: Язык пользовательского интерфейса

source: Use external authentication
ru: Использовать внешнюю аутентификацию

source: Use external authentication (e.g. Kerberos)
ru: Использовать внешнюю аутентификацию (например, Kerberos)

source: user with role %s
ru: пользователь с ролью %s

source: LDAP group member for access with role %s
ru: Член группы LDAP для получения доступа с ролью %s

source: LDAP group for access with role %s
ru: Группа LDAP для получения доступа с ролью %s

source: Authentication
ru: Аутентификация

source: Search on LDAP server
ru: Поиск на сервере LDAP

source: Company name
ru: Название организации

source: Company name for search employee on LDAP server
ru: Название организации для поиска сотрудников на сервере LDAP

source: Search base
ru: База поиска

source: Distinguished name of the search base object for search employee on LDAP server (e.g. CN=Users,DC=fabrikam,DC=com)
ru: Уникальное имя объекта базы поиска для поиска сотрудника на сервере LDAP (например, CN=Users,DC=fabrikam,DC=com)

source: Autocomplete
ru: Автодополнение

source: Autocomplete limit
ru: Ограничение автодополнения

source: Limit for autocomplete search query
ru: Предел для поискового запроса автозаполнения

source: Notification
ru: Уведомление

source: Notify user via E-mail
ru: Уведомлять пользователя по E-mail

source: Use user notification via E-mail
ru: Использовать уведомление пользователя по электронной почте

source: E-mail for contact
ru: Электронная почта для связи

source: E-mail for the contact with the administrator
ru: E-mail для связи с администратором

source: Subject for E-mail
ru: Тема для E-mail

source: Subject for e-mail to contact the administrator
ru: Тема e-mail при обращении к администратору

source: SMTP Server
ru: Сервер SMTP

source: Address of the SMTP server.
ru: Адрес SMTP-сервера.

source: Port
ru: Порт

source: Port of the SMTP server.
ru: Порт SMTP-сервера.

source: Username
ru: Имя пользователя

source: Username for authentication on SMTP server.
ru: Имя пользователя для аутентификации на SMTP сервере.

source: Password
ru: Пароль

source: Caps Lock on
ru: Включен Caps Lock

source: Confirm password
ru: Подтверждение пароля

source: Save
ru: Сохранить

source: Job type
ru: Тип работы

source: Created
ru: Создан

source: Fetched
ru: Извлечён

source: Progress
ru: Ход

source: Reference
ru: Ссылок

source: Failed num.
ru: Кол. ошибок.

source: Failure mess.
ru: Сообщ. ошибки.

source: Status
ru: Состояние

source: &lt;None&gt;
ru: &lt;Нет&gt;

source: Delete task
ru: Удалить задание

source: Are you sure you wish to delete task '%s' created %s?
ru: Вы уверены, что хотите удалить задачу '%s' созданную %s?

source: State queue of tasks
ru: Состояние очереди задач
