Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Plugin/CakeLdap/Locale/rus/LC_MESSAGES/cake_ldap.po
Languages: ru

source: Sync information of employees with LDAP server
ru: Синхронизация информации сотрудников с сервером LDAP

source: Cron task Shell
ru: Оболочка задач Cron

source: This shell is used to execute task scheduled.
ru: Эта оболочка используется для выполнения задач по расписанию.

source: Available tasks: %s.
ru: Доступные задачи: %s.

source: and
ru: и

source: CakePHP Queue Order task.
ru: Очередь CakePHP задача Сортировки.

source: Found order task in queue: %d. Skipped.
ru: Найдено задач в очереди: %d. Пропущено.

source: Tree of employees is broken. Perform a restore.
ru: Дерево из сотрудников разрушено. Выполните восстановление.

source: Error on reorder tree of employee.
ru: Ошибка при пересортиовке дерева сотрудников

source: CakePHP Queue Recovery task.
ru: Очередь CakePHP задача Восстановления.

source: Found recovery task in queue: %d. Skipped.
ru: Найдено задач восстановления в очереди: %d. Пропущено.

source: The recovery tree of employees is not required
ru: Восстановление дерева сотрудников не требуется

source: Error on recovery tree of employee.
ru: Ошибка при восстановлении дерева сотрудников.

source: Error on synchronizing the employee tree with LDAP server.
ru: Ошибка при синхронизации дерева сотрудников с сервером LDAP.

source: CakePHP Queue Sync task.
ru: Задача Синхронизации Очереди CakePHP.

source: Found sync task in queue: %d. Skipped.
ru: Найдено задач cинхронизации в очереди: %d. Пропущено.

source: This task is used to synchronization information with LDAP server scheduled.
ru: Эта задача используется для синхронизации информации с сервером LDAP по расписанию.

source: Synchronization with LDAP server in progress...
ru: Синхронизация с сервером LDAP выполняется...

source: Synchronization with LDAP server set in queue successfully.
ru: Синхронизация с сервером LDAP успешно поставлена в очередь.

source: Synchronization with LDAP server set in queue unsuccessfully.
ru: Синхронизация с сервером LDAP поставлена в очередь неудачно.

source: The database does not contain information on the tree view
ru: База данных не содержит информацию о деревовидном представлении

source: Invalid username or password, try again
ru: Неверное имя пользователя или пароль, попробуйте ещё раз

source: Employees not found
ru: Сотрудники не найдены

source: Invalid ID for employee
ru: Неверный идентификатор сотрудника

source: Synchronization information of employees put in queue...
ru: Синхронизация информации сотрудников поставлена в очередь...

source: Synchronization information of employees put in queue unsuccessfully
ru: Синхронизация информации сотрудников поставлена в очередь безуспешно

source: Synchronization information of employees has been finished successfully
ru: Синхронизация информации сотрудников успешно завершена

source: Synchronization information of employees has been finished unsuccessfully
ru: Синхронизация информации о сотрудниках завершена неудачно

source: Order tree of employees put in queue...
ru: Сортировка дерева сотрудников поставлена в очередь...

source: Order tree of employees put in queue unsuccessfully
ru: Сортировка дерева сотрудников поставлена в очередь безуспешно

source: Recovery tree of employees put in queue...
ru: Восстановление дерева сотрудников поставлено в очередь...

source: Recovery tree of employees put in queue unsuccessfully
ru: Восстановление дерева сотрудников поставлено в очередь безуспешно

source: Error getting departments information from LDAP server
ru: Ошибка при получении информации об отделах из сервера LDAP

source: Blocked
ru: Заблокировано

source: Deleted
ru: Удалено

source: Saved
ru: Сохранено

# res_msg_type
source: departments
ru: отделов

source: Error getting employees information from database
ru: Ошибка при получении информации о сотрудниках из базы данных

source: Changed manager
ru: Изменён руководитель

# res_msg_type
source: subordinates
ru: подчинённых

source: Error getting employees information from LDAP server
ru: Ошибка при получении информации о сотрудниках из сервера LDAP

source: Employee DN: "%s".
ru: DN Сотрудника: "%s".

source: Model: "%s; "Field: "%s"; Message: "%s".
ru: Модель: "%s"; Поле: "%s"; Сообщение: "%s".

source: Field: "%s"; Message: "%s".
ru: Поле: "%s"; Сообщение: "%s".

source: Error validation employee: %s
ru: Ошибка при проверке сотрудника: %s

source: Deleted binded
ru: Удалено связанное

# res_msg_type
source: employees
ru: сотрудников

source: Result of synchronization
ru: Результат синхронизации

source: record
ru: запись

source: Username
ru: Имя пользователя

source: Username in user principal name format, e.g.: %s
ru: Имя пользователя в формате основного имени пользователя, например: %s

source: Password
ru: Пароль

source: Caps Lock on
ru: Включен Caps Lock

source: Login
ru: Вход

source: Synchronize information of this employee with LDAP server
ru: Синхронизация информации этого сотрудника с сервером LDAP

source: Show or hide buttons
ru: Показать или скрыть кнопки

source: Checking state tree of employees
ru: Проверка состояния дерева сотрудников

source: Employees
ru: Сотрудники

source: Checking tree
ru: Проверка дерева

source: Recovery state of tree
ru: Восстановление состояния дерева

source: Index
ru: Указатель

source: Synchronize information with LDAP server
ru: Синхронизация информации с сервером LDAP

source: Synchronize information of employees with LDAP server
ru: Синхронизировать информацию сотрудников с сервером LDAP

source: Tree of employees
ru: Дерево сотрудников

source: Tree view of employees
ru: Древовидное представление сотрудников

source: Index of employees
ru: Указатель сотрудников

source: Tree view information of employees
ru: Древовидное представление информации о сотрудниках

source: Tree viewing
ru: Просмотр дерева

source: Order tree of employees
ru: Сортировка дерева сотрудников

source: Order tree of employees by alphabet
ru: Сортиовка дерева сотрудников по алфавиту

source: Are you sure you wish to re-order tree of employees?
ru: Вы уверены, что хотите пересортировать дерево сотрудников?

source: Check state tree of employees
ru: Проверка состояния дерева сотрудников

source: Detail information
ru: Подробная информация

source: Synchronize
ru: Синхронизировать

source: Tree of subordinate
ru: Дерево подчинённых

source: Edit tree of subordinate employee
ru: Редактирование дерева подчинённых сотрудника

source: Viewing
ru: Просмотр

source: Information of employees
ru: Информация о сотрудниках

source: Authentication
ru: Аутентификация
