Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Plugin/CakeLdap/Locale/rus/LC_MESSAGES/cake_ldap_validation_errors.po
Languages: ru

source: Incorrect GUID of employee
ru: Некорректный GUID сотрудника

source: GUID of employee is not unique
ru: GUID сотрудника не уникален

source: Incorrect distinguished name of employee
ru: Некорректное отличительное имя сотрудника

source: Distinguished name of employee is not unique
ru: Отличное имя сотрудника не уникально

source: Incorrect full name of employee
ru: Некорректное полное имя сотрудника

source: Incorrect last name of employee
ru: Некорректная фамилия сотрудника

source: Incorrect first name of employee
ru: Некорректное имя сотрудника

source: Incorrect middle name of employee
ru: Некорректное отчество сотрудника

source: Incorrect position of employee
ru: Некорректная должность сотрудника

source: Incorrect E-mail address
ru: Некорректный адрес электронной почты

source: Incorrect primary key
ru: Неправильный первичный ключ

source: Incorrect name of department
ru: Некорректное наименование отдела

source: Name of department is not unique
ru: Наименование отдела не является уникальным

source: This field must contain a valid local telephone number.
ru: Это поле должно содержать действительный местный номер телефона.

source: This field must contain a valid mobile telephone number.
ru: Это поле должно содержать действительный номер мобильного телефона.

source: Incorrect value
ru: Неверное значение

source: You must enter username.
ru: Вы должны ввести имя пользователя.

source: You must enter password.
ru: Вы должны ввести пароль.
