Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Plugin/CakeExtendTest/Locale/rus/LC_MESSAGES/cake_extend_test.po
Languages: ru

source: Extended bake task Shell
ru: Расширенная оболочка Bake

source: This shell is used to bake extended test case.
ru: Эта оболочка используется выпекания расширенного теста.

source: All tests
ru: Все тесты

source: Target object is not object
ru: Целевой объект не является объектом

source: Method %s does not exist in target object
ru: Метод %s не существует в целевом объект

source: Invalid params for method %s
ru: Недействительные параметры для метода %s

source: Invalid expectation for the method %s
ru: Неверное ожидание для метода %s

source: Keys for params and expectations is not equals
ru: Ключи для параметров и ожиданий не равны

source: method
ru: метода

source: function
ru: функции

source: Testing %s %s. Step %d of %d.
ru: Тестирование %s %s. Шаг %d из %d.

source: Error parse expected
ru: Ошибка разбора ожидания

source: where
ru: где

source: Empty URL for checking redirect
ru: Пустой URL для проверки перенаправления

source: Empty file name for checking download
ru: Пустое имя файла для проверки скачивания

source: Invalid file size for checking download
ru: Неверный размер файла для проверки скачивания

source: Invalid object Controller for checking "Is Authorized"
ru: Неверный объект Контроллера для проверки "Is Authorized"

source: Invalid object Controller component Auth for checking "Is Authorized"
ru: Неверный объект Контроллера компонента Auth для проверки "Is Authorized"

source: Result is not equal expected
ru: Результат не равен ожиданию

source: Extension "Runkit" is not loaded
ru: Расширение "Runkit" Runkit не загружено

source: Option "runkit.internal_override" is False
ru: Настройка "runkit.internal_override" является Ложной
