Repository: anklimsk/internal-ldap-based-phonebook
Catalog: app/Plugin/CakeInstaller/Locale/rus/LC_MESSAGES/cake_installer.po
Languages: ru

source: Do not prompt for confirmation. Be careful!
ru: Не запрашивать подтверждение. Будьте осторожны!

source: Empty command list. See config file.
ru: Пустой список команд. См конфигурационный файл.

source: Continue installation process?
ru: Продолжить процесс установки?

source: Installer task Shell
ru: Оболочка задач Устновщика

source: Input the number of command from list
ru: Введите номер команды из списка

source: Please choose command of installer:
ru: Пожалуйста, выберите команду инсталлятора:

source: Are you sure?
ru: Вы уверены?

source: Empty command list for action install. See config file.
ru: Пустой список команд для действия установка. См конфигурационный файл.

source: Invalid command list for action install. See config file.
ru: Неверный список команд для действия установка. См конфигурационный файл.

source: Application is installed. Reinstall?
ru: Приложение установлено. Переустановить?

source: Intsall: step %d of %d
ru: Установка: шаг %d из %d

source: To apply the changes, restart the installer.
ru: Чтобы применить изменения, перезапустите программу установки.

source: Intsall: completed
ru: Установка: завершена

source: Running post-install actions
ru: Выполнение действий после установки

source: The installation process is completed successfully.
ru: Процесс установки завершён успешно.

source: The installation process is completed unsuccessfully.
ru: Процесс установки завершён неудачно.

source: Configure database connections
ru: Настройка подключений к базе данных

source: This action has already been successfully completed. Skipped.
ru: Это действие уже успешно завершено. Пропущено.

source: Creating database and initializing data
ru: Создание базы данных и инициализация данных

source: All schemas exists. Re-create?
ru: Все схемы существуют. Создать заново?

source: Create schema of application
ru: Создать схему приложения

source: Create additional schemes
ru: Создать дополнительные схемы

source: Create additional scheme: '%s'
ru: Создать дополнительную схему: '%s'

source: Creating additional schemes completed.
ru: Создание дополнительных схем завершено.

source: Creating symbolic links to files
ru: Создание символьных ссылок на файлы

source: All symbolic links to files exists. Rewrite?
ru: Все символические ссылки на файлы существуют. Переписать?

source: List of symbolic links is empty
ru: Список символьных ссылок пуст

source: Bad
ru: Плохо

source: Creating symbolic links completed successfully.
ru: Создание символьных ссылок завершено успешно.

source: Creating symbolic links unsuccessfully.
ru: Создание символьных ссылок завершено неудачно.

source: Creating cron jobs
ru: Создание заданий cron

source: Server OS is Windows. Creating cron jobs skipped.
ru: Серверная ОС - Windows. Создание заданий cron пропущено.

source: All cron jobs exists. Rewrite?
ru: Все задания cron существуют. Переписать?

source: List of cron jobs is empty
ru: Список заданий cron пуст

source: Error on getting the username of the web server process
ru: Ошибка при получении имени пользователя процесса веб-сервера

source: Error on getting crontab for user '%s'
ru: Ошибка при получении crontab для пользователя '%s'

source: Error on creation copy of current crontab.
ru: Ошибка при создании копии текущего crontab.

source: Error on closing cron file.
ru: Ошибка при закрытии файла cron.

source: Error on updating crontab.
ru: Ошибка при обновлении crontab.

source: Error on creation copy of previous crontab.
ru: Ошибка при создании копии предыдущего crontab.

source: Crontab update is not required.
ru: Обновление crontab не требуется.

source: Creating cron jobs completed successfully.
ru: Создание заданий cron завершено успешно.

source: Creating cron jobs unsuccessfully.
ru: Создание заданий cron завершено неудачно.

source: Setting default timezone
ru: Настройка часового пояса по умолчанию

source: Default timezone set to '%s'. Change?
ru: Часовой пояс по умолчанию установлен в '%s'. Изменить?

source: Default timezone is not changed.
ru: Часовой пояс по умолчанию не изменён.

source: Default timezone set to '%s' successfully.
ru: Часовой пояс по умолчанию установлен в '%s' успешно.

source: Unable to set default timezone, you should change it in %s
ru: Невозможно установить часовой пояс по умолчанию, вы должны изменить его в %s

source: Setting base URL
ru: Настройка базового URL

source: Base URL set to '%s'. Change?
ru: Базовый URL установлен в '%s'. Изменить?

source: Base URL is not changed.
ru: Базовый URL не изменён.

source: Base URL set to '%s' successfully.
ru: Базовый URL установлен в '%s' успешно.

source: Unable to set Base URL, you should change it in %s
ru: Невозможно установить базовый URL, вы должны изменить его в %s

source: Setting security keys
ru: Настройка ключей защиты

source: The security keys is set. Rewrite?
ru: Ключи безопасности установлены. Переписать?

source: Random hash key created for 'Security.salt'
ru: Создан случайный хэш ключ для 'Security.salt'

source: Unable to generate random hash for 'Security.salt', you should change it in %s
ru: Невозможно создать случайный хэш для 'Security.salt', вы должны изменить его в %s

source: Random seed created for 'Security.cipherSeed'
ru: Создано случайное зерно для 'Security.cipherSeed'

source: Unable to generate random seed for 'Security.cipherSeed', you should change it in %s
ru: Невозможно создать случайное зерно для 'Security.cipherSeed', вы должны изменить его в %s

source: Random key created for 'Security.key'
ru: Создан случайный хэш ключ для 'Security.key'

source: Unable to generate random key for 'Security.key', you should change it in %s
ru: Невозможно создать случайный хэш для 'Security.key', вы должны изменить его в %s

source: The security keys is written successfully.
ru: Ключи безопасности записаны успешно.

source: The security keys is written unsuccessfully.
ru: Ключи безопасности записаны неудачно.

source: Setting application UI language
ru: Настройка языка пользовательского интерфейса приложения

source: List of UI languages is empty
ru: Список языков пользовательского интерфейса пуст.

source: Incorrect language code '%s'
ru: Некорректный код языка '%s'

source: Input the number of language from list
ru: Введите номер языка из списка

source: Please choose language of application UI:
ru: Пожалуйста, выберите язык интерфейса приложения:

source: Application UI language is not changed.
ru: Язык интерфейса приложения не изменён.

source: Application UI language set successfully.
ru: Язык интерфейса приложения установлен успешно.

source: Application UI language set unsuccessfully.
ru: Язык пользовательского интерфейса приложения установлен неудачно.

source: Checking PHP version
ru: Проверка версии PHP

source: Current PHP version: %s
ru: Текущая версия PHP: %s

source: Checking PHP extensions
ru: Проверка расширений PHP

source: Checking module is loaded: '%s'
ru: Проверка загрузки модуля: '%s'

source: Check completed successfully.
ru: Проверка завершена успешно.

source: Check completed unsuccessfully.
ru: Проверка завершена неудачно.

source: Checking database connections
ru: Проверка подключения к базе данных

source: Checking database configuration file
ru: Проверка файла конфигурации базы данных

source: Database configuration file
ru: Файл конфигурации базы данных

source: Checking database connection: '%s'
ru: Проверка подключения к базе данных: '%s'

source: Change database connections?
ru: Измененить подключения к базе данных?

source: Setting permissions
ru: Установка разрешений

source: Server OS is Windows. Change permissions skipped.
ru: Серверная ОС - Windows. Изменение разрешений пропущено.

source: Could not change the mode on '%s' to '%s'
ru: Не удалось изменить режим '%s' на '%s'

source: Access permissions on '%s' changed to '%s' successfully.
ru: Разрешения доступа к '%s' успешно изменены на '%s'.

source: Error getting the username of the web server process
ru: Ошибка получения имени пользователя процесса веб-сервера

source: Could not change owner on '%s' to '%s'
ru: Не удалось сменить владельца в '%s' на '%s'

source: Owner of '%s' changed to '%s' successfully.
ru: Владелец '%s' успешно изменен на '%s'.

source: Input the number of scope time zone from list
ru: Введите номер области часового пояса из списка

source: Please choose scope of time zone:
ru: Пожалуйста, выберите область часового пояса:

source: Input the number of timezone from list
ru: Введите номер часового пояса из списка

source: Please choose time zone:
ru: Пожалуйста, выберите часовой пояс:

source: Input base URL (e.g. %s):
ru: Введите базовый URL (например, %s):

source: Unknown parameter
ru: Неизвестный параметр

source: Invalid validation pattern of parameter '%s'. Validation skipped.
ru: Недопустимый шаблон проверки параметра '%s'. Проверка пропущена.

source: Database Configuration:
ru: Конфигурации Базы данных:

source: Connection name
ru: Имя подключения

source: Input the number of connection name from list
ru: Введите номер имени подключения из списка.

source: Please choose connection name:
ru: Пожалуйста, выберите имя подключения:

source: Database Configuration: %s
ru: Конфигурация базы данных: %s

source: No
ru: Нет

source: Do you wish to add another database configuration?
ru: Вы хотите добавить другую конфигурацию базы данных?

source: The following database configuration will be created:
ru: Будет создана следующая конфигурация базы данных:

source: Parameter name
ru: Имя параметра

source: Parameter value
ru: Значение параметра

source: Look okay?
ru: Посмотрите, в порядке?

source: %s not found
ru: %s не найден

source: Please wait...
ru: Пожалуйста, подождите...

source: Input the number from list
ru: Введите номер из списка

source: Exit
ru: Выход

source: Prev page
ru: Предыдущая страница

source: Next page
ru: Следующая страница

source: Page %d of %d
ru: Страница %d из %d

source: Checking PHP environment
ru: Проверка PHP окружения

source: Setting file system permissions on the temporary directory
ru: Настройка разрешений файловой системы на временном каталоге

source: Setting security key
ru: Установка ключа безопасности

source: Setting timezone
ru: Установка часового пояса

source: Checking connect to database
ru: Проверка подключения к базе данных

source: Creation database and initialization data
ru: Создание базы данных и инициализация данных

source: Creation symbolic links to files
ru: Создание символьных ссылок на файлы

source: Creation cron jobs
ru: Создание заданий cron

source: Install this application
ru: Устновка этого приложения

source: Version of LDAP protocol
ru: Версия протокола LDAP

source: Checking installation of application
ru: Проверка установки приложения

source: to run the interactive installer
ru: для запуска интерактивного установщика

source: to check the readiness of the start installation
ru: для проверки готовности начала установки

source: to start the installation process
ru: для начала процесса установки

source: to get help
ru: для получения справки

source: Application is not installed
ru: Приложение не установлено

source: Application is not installed (ready to install)
ru: Приложение не установлено (готово к установке)

source: To install the application, go to the OS console, navigate to the directory %s application, and run the following commands:
ru: Для установки приложения зайдите в консоль ОС, перейдите в каталог %s приложения, и выполните следующие команды:

source: Application is installed
ru: Приложение установлено

source: Checking possibility of writing to files
ru: Проверка возможности записи в файлы

source: file
ru: файл

source: directory
ru: каталог

source: Checking write to %s: '%s'
ru: Проверка записи в %s: '%s'

source: Installation of application
ru: Установка приложения
